In [ ]:
import pandas as pd

In [3]:
data = pd.read_excel("./data/ecom-sales.xlsx")

In [4]:
data.head(3)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,1422

In [5]:
data.tail(3)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category,Purchase
269,1000048,P00223242,M,26-35,4,B,3,1,5,7048
270,1000048,P00114942,M,26-35,4,B,3,1,1,15783
271,1000048,P00277442,M,26-35,4,B,3,1,1,11396

In [6]:
data.describe()

,User_ID,Occupation,Marital_Status,Product_Category,Purchase
count,2.720000e+02,272.000000,272.000000,272.000000,272.000000
mean,1.000026e+06,6.849265,0.518382,4.963235,9186.628676
std,1.281626e+01,5.839432,0.500583,3.509414,5026.241883
min,1.000001e+06,0.000000,0.000000,1.000000,584.000000
25%,1.000017e+06,3.000000,0.000000,1.000000,5410.000000
50%,1.000026e+06,5.500000,1.000000,5.000000,7879.500000
75%,1.000036e+06,10.000000,1.000000,8.000000,12196.250000
max,1.000048e+06,20.000000,1.000000,16.000000,20961.000000

In [7]:
data.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category',
       'Purchase'],
      dtype='object')

In [ ]:
data[['User_ID', 'Product_ID', 'Marital_Status']]

In [28]:
import seaborn as sns